kepler-444b/HC32F002/mcu/common/system_hc32f002.c
/******************************************************************************
 * Copyright (C) 2021, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************/

/******************************************************************************
 ** @file system_hc32f002.c
 **
 ** @brief Source file for SYSTEM functions
 **
 ** @author MADS Team
 **
 ******************************************************************************/

/******************************************************************************/
/* Include files                                                              */
/******************************************************************************/
#include "base_types.h"
#include "hc32f002.h"
#include "system_hc32f002.h"
#include "sysctrl.h"

/**
 ******************************************************************************
 ** System Clock Frequency (Core Clock) Variable according CMSIS
 ******************************************************************************/
uint32_t SystemCoreClock = 4000000;
uint32_t SystemHCLK = 4000000;
uint32_t SystemPCLK = 4000000;

// add clock source.
void SystemCoreClockUpdate(void) // Update SystemCoreClock variable
{
    SystemCoreClock = SYSCTRL_GetHCLK();
}

/**
 ******************************************************************************
 ** \brief  Setup the microcontroller system. Initialize the System and update
 ** the SystemCoreClock variable.
 **
 ** \param  none
 ** \return none
 ******************************************************************************/
void SystemInit(void)
{
    SYSCTRL->RCL_f.TRIM = SYSCTRL_RCL_TRIM_32p8KHz;
    SYSCTRL->RCH_f.TRIM = SYSCTRL_RCH_TRIM_48MHz;
    SYSCTRL->RCH_f.DIV = 0; // 不分频
    SystemCoreClockUpdate();
}

#if defined(__CC_ARM)
extern int $Super$$main(void);
/* re-define main function */
int $Sub$$main(void)
{
    SystemInit();
    $Super$$main();
    return 0;
}
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
extern int $Super$$main(void);
/* re-define main function */
int $Sub$$main(void)
{
    SystemInit();
    $Super$$main();
    return 0;
}
#elif defined(__ICCARM__)
extern int main(void);
/* __low_level_init will auto called by IAR cstartup */
extern void __iar_data_init3(void);
int __low_level_init(void)
{
    // call IAR table copy function.
    __iar_data_init3();
    SystemInit();
    main();
    return 0;
}
#endif
